{
  "education": [
    {
      "awards_achievements": [
        "University of Toronto Scholar",
        "UTM Entrance Award",
        "GPA: 3.2/4.0"
      ],
      "degree": "Honours Bachelor of Science",
      "department": "Computer Science",
      "duration": "2017-2022",
      "school_name": "University of Toronto Mississauga"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_end_MaximilianHuang",
  "highlighted_projects": [
    {
      "description": "Created a full-stack web application as part of a team of 4. Application was designed near the beginning of the COVID-19 pandemic as a forum where elderly, immunocompromised, and any other users can make requests that can be fulfilled by other users. Posts were listed in a Twitter-like feed, which was created, along with the rest of the front-end, using React. Other features included direct messages, a leaderboard page, and Google Maps integration. The back-end and REST API handling user and post data were created using Node.js, Express.js, and MongoDB. App was hosted online using Heroku.",
      "git_url": "https://github.com/manacute/helping_hands",
      "name": "Helping Hands"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Designed an application in Bash and SQL used to monitor system specifications and performance on a cluster network. Each system in the network gathers hardware specifications and resource usage using Bash scripts, which are then submitted to a PostgreSQL database, hosted on a single system running a Postgres Docker container. The application is scheduled to run regularly on each system using crontab.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Developed a CLI application in Java used to perform CRD operations on Tweets. Using the arguments provided from the command-line, the application submits the information to the Twitter REST API. The OAuth library was used to authenticate the app to a user account, Maven for building and dependency management.",
        "JDBC App: Developed an application in Java using the JDBC API to perform CRUD operations on a Postgres database. App implements DAO pattern to allow for abstraction of database operations. App built using Maven.",
        "Grep App: Developed an application in Java emulating the Linux grep utility. Using Java regex libraries, app searches through files in a specified directory and all of its sub-directories recursively, listing lines that match the regular expression provided. App built using Maven, and containerized using Docker."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Max Huang",
  "others": [
    {
      "bullets": [
        "Cooking",
        "Competitive gaming",
        "Music"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed various applications for uses such as system monitoring, finding certain strings in files, and post/view/delete Tweets. Used technologies including Java, Bash, SQL, Docker, Maven, Linux, and Git. Worked in a Scrum/Agile environment, with daily stand ups and bi-weekly sprint planning meetings.",
      "duration": "November 2022 - present",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "Javascript",
      "React",
      "Node.js",
      "Express.js",
      "Docker",
      "LaTeX"
    ],
    "familiar": [
      "Haskell",
      "MongoDB",
      "HTML",
      "CSS",
      "Angular"
    ],
    "proficient": [
      "Java",
      "Python",
      "C, C++",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a recent graduate of the University of Toronto Mississauga with a bachelor's degree in computer science. I am currently a software developer at Jarvis Consulting Group, where I have gained experience working in an Agile environment, developing various projects using technologies such as Java, PostgreSQL, Bash, Maven, Docker, and Git. I also have experience using other technologies for academic projects, including React, Node.js, MongoDB, and Python. My passion for computer science, which began in a high school introductory class, stems from my love of overcoming difficult problems with creative solutions. I am looking for an opportunity to apply and grow my skill-set in the software development or full-stack industry."
}
